[
  {
    "id": 1,
    "title": "JavaScript",
    "type": "Programming Language",
    "description": "Used JavaScript to build and maintain full-stack web applications. I often work on creating functions that fetch data from APIs, handle asynchronous logic, and integrate frontend and backend components to deliver smooth user experiences."
  },
  {
    "id": 2,
    "title": "TypeScript",
    "type": "Superset of JavaScript",
    "description": "Introduced to TypeScript while working on a React project. Applied basic typing for props, state, and functions to improve code clarity. My exposure lasted around two months, giving me a foundation in integrating TypeScript with frontend development, though I am still learning deeper concepts."
  },
  {
    "id": 3,
    "title": "HTML",
    "type": "Markup Languages ",
    "description": "Worked with HTML along the Vuetify to structure user interfaces, enabling me to effectively display fetched data in reports and other data-driven views."
  },
  {
    "id": 4,
    "title": "CSS",
    "type": "Styling Sheet Language",
    "description": "Experienced in maintaining and styling user interfaces, focusing on inline and internal CSS. When new features are added, I ensure the code structure remains clean and organized."
  },
  {
    "id": 5,
    "title": "Vue.js",
    "type": "Frontend Framework",
    "description": "Maintained and enhanced user interfaces using Vue.js and Vuetify, added features like table columns and displayed dynamic report data from APIs, primarily for internal web reports."
  },
  {
    "id": 6,
    "title": "Vuetify",
    "type": "User Interface Framework ",
    "description": "Used Vuetify as a UI component framework alongside Vue.js to build a clean user interfaces. I commonly used its built-in components like date pickers, buttons, cards, and layout templates to speed up development, especially when creating internal reports and admin features."
  },
  {
    "id": 7,
    "title": "React.js",
    "type": "Frontend Library",
    "description": "Gained exposure to React.js during my time in a previous company. Worked on building components, handling props and state, and applying React basics in a real project. While my experience is about two months, it gave me a practical introduction to the library, and I am continuing to strengthen my skills."
  },
  {
    "id": 8,
    "title": "React Router",
    "type": "Routing Library",
    "description": "Learned the basics of React Router by implementing page navigation and simple dynamic routes in a React project. My exposure was around two months in real project, giving me an initial understanding of routing, though I am still developing deeper knowledge."
  },
  {
    "id": 9,
    "title": "Tailwind",
    "type": "CSS Framework",
    "description": "Gained exposure to Tailwind CSS in both my personal portfolio and real projects. Applied utility-first classes to build responsive layouts and maintain clean UI structures."
  },
  {
    "id": 10,
    "title": "Express.js",
    "type": "Backend Framework",
    "description": "Implemented RESTful APIs using Express.js to manage CRUD operations efficiently. I used it to define routes, making it easier to handle data fetching, updating, and overall backend structure in a clean and organized way."
  },
  {
    "id": 11,
    "title": "Node.js",
    "type": "Runtime Environment",
    "description": "Developed backend features with Node.js to support frontend data needs, handling server-side logic and asynchronous operations. I used it as the foundation for building scalable applications, managing API requests, and connecting to databases through libraries like Sequelize."
  },
  {
    "id": 12,
    "title": "Sequelize",
    "type": "Object Relational Mapping",
    "description": "Experienced in using Sequelize as an ORM for managing models, relationships, and queries with PostgreSQL databases. I applied it to define clear data structures and efficiently handle data retrieval, creation, and updates within my Express.js applications."
  },
  {
    "id": 13,
    "title": "PostgreSQL",
    "type": "Database Management",
    "description": "Used PostgreSQL as the primary database to store and manage application data. I frequently performed direct queries to fetch and inspect data, ensuring accurate results for reports and analysis."
  },
  {
    "id": 14,
    "title": "Git Processes",
    "type": "Software Tool",
    "description": "Experienced using Git for version control, performing common operations like cloning repositories, checking out branches, and managing changes with commits. "
  },
  {
    "id": 15,
    "title": "Postman",
    "type": "Software Tool",
    "description": "Tested various API endpoints using Postman, ensuring that they return the correct data as expected. This tool allowed me to verify and validate API responses, contributing to smooth and reliable integrations between the frontend and backend."
  },
  {
    "id": 16,
    "title": "BitBucket",
    "type": "Repository Management Tool",
    "description": "Used Bitbucket for managing repositories, collaborating with teams, and handling version control. I committed code, managed branches, and submitted pull requests to the main branch for smooth integration."
  },
  {
    "id": 17,
    "title": "Github",
    "type": "Repository Management Tool",
    "description": "Used GitHub for managing version control in personal projects, including my portfolio. I practiced committing code, creating branches, and pushing updates to organize and track progress while learning best practices."
  },
  {
    "id": 18,
    "title": "Jira",
    "type": "Project Management Tool",
    "description": "Had brief exposure to Jira in my previous company. Used it for basic task tracking and viewing project tickets. My experience was limited, but it gave me an idea of how Agile teams manage and track work items."
  },
  {
    "id": 19,
    "title": "Trello",
    "type": "Project Management Tool",
    "description": "Used Trello in my first company to manage tasks on boards, track progress, and collaborate with the team. This gave me practical familiarity with organizing work items in a visual, card-based workflow."
  },
  {
    "id": 20,
    "title": "Odoo",
    "type": "Project Management Tool",
    "description": "Used Odoo in my first company primarily for task and project tracking. Gained experience navigating tickets to monitor progress, update records, and support daily workflows."
  },
  {
    "id": 21,
    "title": "Figma",
    "type": "Design Tools",
    "description": "Used Figma designs as the basis for implementing frontend code in my previous company. I translated UI layouts into working components, ensuring the final output matched the design specifications. In personal projects, I also use Figma to draft clean layouts that guide my development process."
  },
  {
    "id": 22,
    "title": "Canva",
    "type": "Design Tools",
    "description": "Used Canva to design logos, and other visual assets for personal projects. Focused on creating clean, professional designs while continuing to explore its features."
  }
]
